using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace NetworkApplicationDevelopmentServer.Lections.Lection7
{
    internal class Lec7
    {
        // Библиотека
        // ● Class Libraries (Библиотеки классов)
        // ● NuGet Packages(Пакеты NuGet)
        // ● COM Libraries(COM-библиотеки)
        // ● Native Libraries(Нативные библиотеки)
        // ● Portable Libraries(Портативные библиотеки)
        // ● ASP.NET Core Middleware(Промежуточное программное обеспечение ASP.NET Core)

        // Библиотека классов - Представляет собой скомпилированный набор классов и методов, который можно использовать в других
        // .NET приложениях.

        // NetMQ предоставляет следующие преимущества и возможности:
        // ● Асинхронность: NetMQ позволяет выполнять асинхронное взаимодействие между компонентами системы.
        //      Это позволяет легко создавать высокопроизводительные и отзывчивые приложения.
        // ● Многоплатформенность: NetMQ совместима с различными операционными системами и может быть использована на платформах,
        //      поддерживающих.NET.
        // ● Модель обмена сообщениями: NetMQ использует модель обмена сообщениями, основанную на сокетах,
        //      что упрощает создание распределенных систем, а также реализацию шаблонов обмена сообщениями,
        //      таких, как публикация-подписка, запрос-ответ и другие.
        // ● Высокая производительность: NetMQ разработана с учетом высокой производительности и низкой задержки.
        //      Она позволяет эффективно передавать сообщения между процессами даже при больших нагрузках.
        // ● Гибкость: NetMQ предоставляет разработчикам инструменты для гибкой настройки и настройки
        //      сетевого взаимодействия в зависимости от конкретных потребностей приложения.



        public void Run()
        { }
    }
}
